class PostDB:
    storage = [
        {
            "id": 1,
            "title": "Apple припиняє випуск iPhone 11",
            "text": """
            Не зважаючи на те, що останнім і найкращим iPhone від Apple тепер є лінійка iPhone 14 Pro з вирізом у формі таблетки «Dynamic Island» і привабливою анімацією, компанія вирішила залишити в лінійці кілька старіших моделей. Підтримка двох старих поколінь iPhone робить смартфони Apple доступнішими для мас, забезпечуючи оптимальний вибір для кожної цінової категорії. Цього року вся лінійка iPhone має одну помітну особливість: усі моделі підтримують 5G.

            Після презентації iPhone 14, 14 Plus, 14 Pro та 14 Pro Max Apple знищила трирічний iPhone 11, єдиний iPhone без підтримки 5G. Усі інші моделі підтримують мережі п’ятого покоління. Ось лінійка iPhone від Apple 2022-2023 років:

            iPhone SE (модель третього покоління 2022) – 429 доларів
            iPhone 12 – $599
            iPhone 13 і 13 mini – $699 і $599
            iPhone 14 і 14 Plus – $799 і $899
            iPhone 14 Pro і 14 Pro Max – 999 і 1099 доларів
            Щоб iPhone 11 зник з інтернет-магазинів, потрібен деякий час, тому у яких бажають  придбати цей став уже класичним смартфон дешево все ще є кілька варіантів. Але якщо ви хочете придбати новий iPhone безпосередньо від Apple, найдоступніші варіанти – старий iPhone SE з кнопкою «Додому» або iPhone 12. 5G не є остаточною причиною для оновлення телефону, але це все одно приємно. бонус, який допоможе прискорити розвиток мережі нового покоління.
            """
        },
        {
            "id": 2,
            "title": "Apple",
            "text": """
                Не зважаючи на те, що останнім і найкращим iPhone від Apple тепер є лінійка iPhone 14 Pro з вирізом у формі таблетки «Dynamic Island» і привабливою анімацією, компанія вирішила залишити в лінійці кілька старіших моделей. Підтримка двох старих поколінь iPhone робить смартфони Apple доступнішими для мас, забезпечуючи оптимальний вибір для кожної цінової категорії. Цього року вся лінійка iPhone має одну помітну особливість: усі моделі підтримують 5G.

                Після презентації iPhone 14, 14 Plus, 14 Pro та 14 Pro Max Apple знищила трирічний iPhone 11, єдиний iPhone без підтримки 5G. Усі інші моделі підтримують мережі п’ятого покоління. Ось лінійка iPhone від Apple 2022-2023 років:

                iPhone SE (модель третього покоління 2022) – 429 доларів
                iPhone 12 – $599
                iPhone 13 і 13 mini – $699 і $599
                iPhone 14 і 14 Plus – $799 і $899
                iPhone 14 Pro і 14 Pro Max – 999 і 1099 доларів
                Щоб iPhone 11 зник з інтернет-магазинів, потрібен деякий час, тому у яких бажають  придбати цей став уже класичним смартфон дешево все ще є кілька варіантів. Але якщо ви хочете придбати новий iPhone безпосередньо від Apple, найдоступніші варіанти – старий iPhone SE з кнопкою «Додому» або iPhone 12. 5G не є остаточною причиною для оновлення телефону, але це все одно приємно. бонус, який допоможе прискорити розвиток мережі нового покоління.
                """
        },
        {
            "id": 3,
            "title": "iPhone 11",
            "text": """
                Не зважаючи на те, що останнім і найкращим iPhone від Apple тепер є лінійка iPhone 14 Pro з вирізом у формі таблетки «Dynamic Island» і привабливою анімацією, компанія вирішила залишити в лінійці кілька старіших моделей. Підтримка двох старих поколінь iPhone робить смартфони Apple доступнішими для мас, забезпечуючи оптимальний вибір для кожної цінової категорії. Цього року вся лінійка iPhone має одну помітну особливість: усі моделі підтримують 5G.

                Після презентації iPhone 14, 14 Plus, 14 Pro та 14 Pro Max Apple знищила трирічний iPhone 11, єдиний iPhone без підтримки 5G. Усі інші моделі підтримують мережі п’ятого покоління. Ось лінійка iPhone від Apple 2022-2023 років:

                iPhone SE (модель третього покоління 2022) – 429 доларів
                iPhone 12 – $599
                iPhone 13 і 13 mini – $699 і $599
                iPhone 14 і 14 Plus – $799 і $899
                iPhone 14 Pro і 14 Pro Max – 999 і 1099 доларів
                Щоб iPhone 11 зник з інтернет-магазинів, потрібен деякий час, тому у яких бажають  придбати цей став уже класичним смартфон дешево все ще є кілька варіантів. Але якщо ви хочете придбати новий iPhone безпосередньо від Apple, найдоступніші варіанти – старий iPhone SE з кнопкою «Додому» або iPhone 12. 5G не є остаточною причиною для оновлення телефону, але це все одно приємно. бонус, який допоможе прискорити розвиток мережі нового покоління.
                """
        }
    ]
    last_id = 3

    def get_all(self):
        return self.storage


    def get_one(self, id_):
        for post in self.storage:
            if post["id"] == id_:
                return post


    def create(self, title, text):
        self.last_id += 1
        new_post = {
            "id": self.last_id,
            "title": title,
            "text": text
        }
        self.storage.append(new_post)
        return new_post


    def update(self, id_,text, title):
        post = {
            "id": id_,
            "title": title,
            "text": text
        }
        for i in range(len(self.storage)):
            if self.storage[i].get("id") == id_:
                self.storage[i] = post

        return post


    def delete(self, id_):
        self.storage=[post for post in self.storage if post["id"] != id_]